<!--
 * @Author: Code_Master
 * @Date: 2020-09-17 15:00:51
 * @LastEditTime: 2020-09-17 15:41:10
 * @LastEditors: Code_Master
 * @FilePath: /privacy-policy/src/components/Info.vue
 * @Description: The first 90% of the code accounts for the first 90% of the development time. The remaining 10% of the code accounts for the other 90% of the development time.
-->
<template>
    <div id="info">
          <h1>红岩网校工作站隐私政策</h1>

          <h2>引言</h2>
          <p><span></span>其明重视用户的隐私，隐私权是您重要的权利。您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《隐私政策》与您所使用的其明服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您的理解。 您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。 如对本《隐私政策》或相关事宜有任何问题，请与我们联系。 </p>

          <h2>我们可能收集的信息</h2>
          <p>我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。</p>
          <h3>您提供的信息</h3>
          <p>您在注册账户或使用我们的服务时，向我们提供的相关个人信息，例如电话号码、电子邮件或银行卡号等；</p>
          <p>您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。</p>
          <h3>其他方分享的您的信息</h3>
          <p>其他方使用我们的服务时所提供有关您的共享信息。</p>
          <h3>我们获取的您的信息</h3>
          <p>您使用服务时我们可能收集如下信息：</p>
          <p>日志信息，指您使用我们的服务时，系统可能通过cookies、web beacon或其他方式自动采集的技术信息，包括：设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；</p>
          <p>在使用我们服务时搜索或浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息；</p>
          <p>您通过我们的服务进行通讯的信息，例如曾通讯的账号，以及通讯时间、数据和时长；</p>
          <p>位置信息，指您开启设备定位功能并使用我们基于位置提供的相关服务时，收集的有关您位置的信息，包括：</p>
          <ul>
              <li>您通过具有定位功能的移动设备使用我们的服务时，通过GPS或WiFi等方式收集的您的地理位置信息；</li>
              <li>您或其他用户提供的包含您所处地理位置的实时信息，例如您提供的账户信息中包含的您所在地区信息，您或其他人上传的显示您当前或曾经所处地理位置的共享信息，您或其他人共享的照片包含的地理标记信息；</li>
          </ul>
          <p>您可以通过关闭定位功能，停止对您的地理位置信息的收集。</p>

          <h2>我们可能如何使用信息</h2>
          <p>我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</p>
          <ul>
              <li>向您提供服务； </li>
              <li>在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性； </li>
              <li></li>
              <li></li>
          </ul>
    </div>
</template>

<script>
export default {
    name: "Info",
}
</script>

<style>
    #info {
        width: 800px;
        margin: 0 auto;
    }
    h2 {
        text-align: left;
    }
    p {
        text-align: left;
    }
    h3 {
        text-align: left;
    }
</style>